%本程序为RS10N型工业机器人的运动学计算程序
%程序输入为机器人的关节角a（单位：弧度），输出为末端位姿矩阵T，其中T为4×4的矩阵，a为6维行向量
function T=Googo_kin3(a)

	P1=430;
	P2=99.56;
	P3=0;
	P4=650.74;
	P5=1.05;
	P6=700.23;
	P7=202;     %225

	a1=a(1);
	a2=a(2);
	a3=a(3);
	a4=a(4);
	a5=a(5);
	a6=a(6);


	t1=[cos(a1),    -sin(a1),   0,  0  
		sin(a1),    cos(a1),    0,  0
		0,  0,  1,  P1
		0,  0,  0,  1];

	t2=[sin(a2) ,   cos(a2),   0,  -P2
		0,  0,  1, 0
		cos(a2),   -sin(a2),    0,  0
		0,  0,  0,  1];

	t3=[cos(a3),    -sin(a3),   0,  P4
		sin(a3),    cos(a3),    0,  0
		0,  0,  1,  P3
		0,  0,  0,  1];

	t4=[cos(a4),    -sin(a4),   0,  P5
		0,  0,  -1, -P6
		sin(a4),    cos(a4),    0,  0
		0,  0,  0,  1];

	t5=[cos(a5),    -sin(a5),   0,  0
		0,  0,  1,  0
		-sin(a5),   -cos(a5),   0,  0
		0,  0,  0,  1];

	t6=[cos(a6),    -sin(a6),   0,  0
		0,  0,  -1,0
		sin(a6),    cos(a6),    0,  0
		0,  0,  0,  1];

	t7=[1,0,0,0
        0,1,0,0
        0,0,1,P7
        0,0,0,1];
	
	T=t1*t2*t3*t4*t5*t6*t7;

end


















